# за день машина проезжает n километров. сколько дней нужно, чтобы проехать маршрут длиной m километров?
# при решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# input:
# n = 700
# m = 750
# output:
# 2
import math

# import math
# n = 700
# m = 750
# # print((m+n-1)//n)
# print(math.ceil(m / n))

# c1, c2, c3 = int(input()), int(input()), int(input())
# print((c1 + 1) // 2 + (c2 + 1) // 2 + (c3 + 1) // 2)
#
# sum_ch = 0
# count_kl = 3
# for i in range(count_kl):
#     count = int(input(f"Введите число учащихся в классе {i+1}:   "))
#     sum_ch += count
# print(f"общее число учащихся {sum_ch}")
#
# print(f"необходимо парт: {math.ceil(sum_ch / 2)}")

# Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем,
# год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.
# Input: 2016
# Output: YES

# year = int(input('Введите год: '))
# if (year % 4 == 0) and (year % 100 != 0) or (year % 400 == 0):
#     print('YES')
# else:
#     print('NO')
